---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrentRating
source: html/b32cb3c2-8052-6bca-6059-deef83c12c14.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrentRating Property

"Current Rating"

## Syntax (C#)
```csharp
public static ForgeTypeId MepAnalyticalElecCurrentRating { get; }
```